/*
Для двох сутностей зі зв’язком з предметної області з вашого варіанту реалізувати збереження таких сутностей та їх
атрибутів у файлі. Наприклад, для предметної області автостоянка, сутностями можуть бути:
•клієнт автостоянки (атрибути: ПІБ, номер водійського посвідчення, номер угоди, ...)
•його автомобіль (марка, реєстраційний номер)Клієнт автостоянки може ставити на ній більш ніж одну машину,
це потрібно врахувати.
Вимоги:
•Реалізувати підтримку двох форматів файлів: текстовий (використати StreamReader та StreamWriter),
бінарний (використати BinaryReader та BinaryWriter). Використатиполіморфізм: інтерфейси, або абстрактні класи.
Є базовий  інтерфейс, або абстрактний клас і є дві реалізації: текстова і бінарна
•Не використовувати сторонні бібліотеки, крім стандартних .NET бібліотеки
•Не використовувати .NET засоби серіалізації кастомних об’єктів, xml-, json-, ini-файлів
•Не можна використовувати кілька файлів, обидві сутності повинні бути збережені в одному файлі.
•Реалізувати інтерактивний командний інтерфейс для керування збережиними даними:
додавання, редагування, видалення, виведення, пошук.
•Реалізувати збереження зв’язку між сутностями: наприклад, які автомобілі належать якому клієнту.
•Для сутностей створити класи: атрибути сутностей це property.
•Можна використовувати: контейнери, LINQ.